# پایه: یک نسخه سبک از پایتون به اسم "اسلیم" که حجمش کمتر از نسخه کامل است
FROM python:3.13-slim

# پوشه‌ای که داخل کانتینر، محل کار اصلی خواهد بود
WORKDIR /usr/src/app

# اول فقط فایل نیازمندی‌ها را کپی می‌کنیم (نه کل کد)
COPY requirements.txt .

# نصب کتابخانه‌ها
RUN pip install --no-cache-dir -r requirements.txt

# حالا کل کد پروژه (همان پوشه app) را کپی می‌کنیم
COPY app/ .

# پورتی که ای‌پی‌آی روی آن گوش می‌دهد را اعلام می‌کنیم
EXPOSE 8000

# دستوری که وقتی کانتینر روشن می‌شود، اجرا خواهد شد
CMD ["./entrypoint.sh"]
